# Задача-1:
# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне.

# Пример:
# Дано: ["яблоко", "банан", "киви", "арбуз"]
# Вывод:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз
#
# Подсказка: воспользоваться методом .format()
fruits = 'apple', 'banana', 'kiwi', 'watermelon'
for i in fruits:
    n = fruits.index(i)
    n+=1
    print('{}. {:>10}'.format(str(n), (i)))
