# Задание - 2
# Создайте функцию, принимающую на вход 3 числа, и возвращающую наибольшее из них

def maximizer (number1, number2, number3):
    return max(number1, number2, number3)
result = maximizer(5,117,99)
print(result)